content/cv.md
+++
title = "CV - Christina O'Donnell"
author = ["Christina O'Donnell"]
linkTitle = "CV"
draft = false
+++

## Professional Summary {#professional-summary}

A dedicated computer science enthusiast with a diverse skill set spanning
various languages and technologies. Proven experience in overcoming complex
technical challenges to enhance program functionality and user experience.
Committed to leveraging extensive knowledge in type theory, logic, and formal
proof to drive project success.


## Technical Skills {#technical-skills}

-   Proficient in: C++, C, Haskell, Python, SQL, HTML, CSS, POSIX Shell, Git
-   Comfortable with: Scheme, plain JavaScript, Go, Scala
-   Technologies: Linux, xDebian, Postfix, Dovecot, git, next cloud, NFTables,
    Certbot, Nginx
-   Other Skills: Type theory, logic, formal proof, Bayesian statistics, causal modeling


## Projects {#projects}

1.  Interactive Help System: Wrote client and server code to connect with an OLE
    object browser instance, requiring a two-way communication channel and
    maintaining consistent tooltip behaviour and appearance across web and
    Windows clients.
2.  Greyed Reasons System: Implemented a system logic that displayed the reason
    why buttons, controls, or menu items were greyed out. This required writing a
    low-level hook to track the location of the mouse relative to nested windows.
3.  Geographical Plotting System Maintenance: Addressed various bugs and
    performance issues in a JavaScript-based geographical plotting system.
4.  Text Editor for X: Developed in C using a gap buffer, with strategic memory
    and performance optimizations. [GitHub](https://github.com/cdo256/cdoedit)
5.  2D Physics Engine: Built from scratch in C++, featuring collision detection,
    PID controllers, and cross-platform support.
6.  Semantic Graphs Research: Working on a meta-theory of language, expressions,
    and structure for potential publication.
7.  Quantum Tunneling Simulation: Created using Processing JS, garnered notable
    attention on Reddit.
8.  Tetris Clone: Developed using Processing JS with animations, showcased on
    Khan Academy.
9.  Twitter Trend Tracker: Collaborative project with roles in server setup,
    website creation using AngularJS, and server logic implementation in Python.
10. Trading Server Development: Rapidly learnt Scala for a hackathon project,
    contributing to a virtual trading server connection.


## Professional Experience {#professional-experience}


### Freelance Tutor in Computer Science {#freelance-tutor-in-computer-science}

-   2023 - Present
-   Online
-   Specializing in tutoring Computer Architecture, Data Structures, Embedded
    Systems, and Imperative Programming.
-   Providing instruction to university undergraduates and adult learners,
    including two A-level students.
-   Conducted over 100 hours of online tutoring, adapting to remote learning
    environments.
-   Prioritizing student satisfaction, reflected in a 5-star rating across all
    reviews.
-   Notable student feedback highlights problem-solving and dedication to
    student success.
-   Managing a client base of 12 students, demonstrating interpersonal and
    organizational skills.


### Software Engineer, Cyberscience Corporation {#software-engineer-cyberscience-corporation}

-   2017 - 2023

Collaborated on a team to modernize a complex data analytics program, employing
diverse technical skills and problem-solving abilities to enhance functionality
and user interaction.


## Education {#education}


### BA in Mathematics and Computer Science, Balliol College, Oxford (2017) {#ba-in-mathematics-and-computer-science-balliol-college-oxford--2017}

-   Awards: Donald Michie Scholar, Balliol College (2015)
-   First Class Honours


## Publications {#publications}


### In Progress {#in-progress}

Research paper on Semantic Graph Language


## Languages {#languages}

-   English


## Hobbies {#hobbies}

-   Wheelchair basketball
-   Board games
-   Desk adaptation project


## Selected Student Feedback {#selected-student-feedback}

-   "Very kind and helpful. She has a great way of stepping through problems one
    at a time." - Chris T (Embedded Systems)
-   "Christina has helped me a lot in our sessions and works hard to help me
    excel in my work. I had a great session and look forward to our next
    meeting!" - Veena V (Computer Architecture)


## References {#references}

Available upon request.
